sanjeev7-marvel/S32_MBD/MATLAB_Add-Ons/Toolboxes/NXP_MBDToolbox_S32K1xx/S32_Platform_SDK/platform/pal/src/timing/timing_irq.c
/*
 * Copyright 2017 NXP
 * All rights reserved.
 *
 * THIS SOFTWARE IS PROVIDED BY NXP "AS IS" AND ANY EXPRESSED OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
 * IN NO EVENT SHALL NXP OR ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
 * IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
 * THE POSSIBILITY OF SUCH DAMAGE.
 */

/*!
 * @file timing_irq.c
 *
 * @page misra_violations MISRA-C:2012 violations
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 8.4, external symbol defined without a prior
 * declaration.
 * These are symbols weak symbols defined in platform startup files (.s).
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 8.7, Function not defined with external linkage.
 * The functions are not defined static because they are referenced in .s startup files.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 8.9, Could define variable at block scope
 * The variable is used in driver c file, so it must remain global.
 */

#include "timing_irq.h"
#include "device_registers.h"

/*******************************************************************************
 * Code
 ******************************************************************************/

/* Define interrupt handler for Timing instance */

/* Define TIMING PAL over LPIT */
#if (defined (TIMING_OVER_LPIT))

#if (FEATURE_LPIT_HAS_NUM_IRQS_CHANS == 1U)
void LPIT0_IRQHandler(void)
{
    uint32_t chanIntFlags = LPIT_DRV_GetInterruptFlagTimerChannels(0U, 0xFU);
    bool chan0IntFlag = ((chanIntFlags & LPIT_MSR_TIF0_MASK) != 0U) ? true : false;
    bool chan1IntFlag = ((chanIntFlags & LPIT_MSR_TIF1_MASK) != 0U) ? true : false;
    bool chan2IntFlag = ((chanIntFlags & LPIT_MSR_TIF2_MASK) != 0U) ? true : false;
    bool chan3IntFlag = ((chanIntFlags & LPIT_MSR_TIF3_MASK) != 0U) ? true : false;

    if (chan0IntFlag)
    {
        TIMING_Lpit_IrqHandler(0U, 0U);
    }

    if (chan1IntFlag)
    {
        TIMING_Lpit_IrqHandler(0U, 1U);
    }

    if (chan2IntFlag)
    {
        TIMING_Lpit_IrqHandler(0U, 2U);
    }

    if (chan3IntFlag)
    {
        TIMING_Lpit_IrqHandler(0U, 3U);
    }
}
#else
void LPIT0_Ch0_IRQHandler(void)
{
    TIMING_Lpit_IrqHandler(0U, 0U);
}

void LPIT0_Ch1_IRQHandler(void)
{
    TIMING_Lpit_IrqHandler(0U, 1U);
}

void LPIT0_Ch2_IRQHandler(void)
{
    TIMING_Lpit_IrqHandler(0U, 2U);
}

void LPIT0_Ch3_IRQHandler(void)
{
    TIMING_Lpit_IrqHandler(0U, 3U);
}
#endif /* FEATURE_LPIT_HAS_NUM_IRQS_CHANS == 1U */

#endif /* TIMING_OVER_LPIT */

/* Define TIMING PAL over LPTMR */
#if (defined (TIMING_OVER_LPTMR))

void LPTMR0_IRQHandler(void)
{
    TIMING_Lptmr_IrqHandler(0U, 0U);
}

#endif /* TIMING_OVER_LPTMR */

/* Define TIMING PAL over PIT */
#if (defined(TIMING_OVER_PIT))

#if (PIT_INSTANCE_COUNT > 0U)
void PIT_Ch0_IRQHandler(void)
{
    TIMING_Pit_IrqHandler(0U, 0U);
}

void PIT_Ch1_IRQHandler(void)
{
    TIMING_Pit_IrqHandler(0U, 1U);
}

void PIT_Ch2_IRQHandler(void)
{
    TIMING_Pit_IrqHandler(0U, 2U);
}

void PIT_Ch3_IRQHandler(void)
{
    TIMING_Pit_IrqHandler(0U, 3U);
}
#if (PIT_TIMER_COUNT > 4U)
void PIT_Ch4_IRQHandler(void)
{
    TIMING_Pit_IrqHandler(0U, 4U);
}

void PIT_Ch5_IRQHandler(void)
{
    TIMING_Pit_IrqHandler(0U, 5U);
}

void PIT_Ch6_IRQHandler(void)
{
    TIMING_Pit_IrqHandler(0U, 6U);
}

void PIT_Ch7_IRQHandler(void)
{
    TIMING_Pit_IrqHandler(0U, 7U);
}

void PIT_Ch8_IRQHandler(void)
{
    TIMING_Pit_IrqHandler(0U, 8U);
}

void PIT_Ch9_IRQHandler(void)
{
    TIMING_Pit_IrqHandler(0U, 9U);
}

void PIT_Ch10_IRQHandler(void)
{
    TIMING_Pit_IrqHandler(0U, 10U);
}

void PIT_Ch11_IRQHandler(void)
{
    TIMING_Pit_IrqHandler(0U, 11U);
}

void PIT_Ch12_IRQHandler(void)
{
    TIMING_Pit_IrqHandler(0U, 12U);
}

void PIT_Ch13_IRQHandler(void)
{
    TIMING_Pit_IrqHandler(0U, 13U);
}

void PIT_Ch14_IRQHandler(void)
{
    TIMING_Pit_IrqHandler(0U, 14U);
}

void PIT_Ch15_IRQHandler(void)
{
    TIMING_Pit_IrqHandler(0U, 15U);
}
#endif /* PIT_TIMER_COUNT > 4U */
#endif /* PIT_INSTANCE_COUNT > 0U */

#if (PIT_INSTANCE_COUNT > 1U)
void PIT1_Ch0_IRQHandler(void)
{
    TIMING_Pit_IrqHandler(1U, 0U);
}

void PIT1_Ch1_IRQHandler(void)
{
    TIMING_Pit_IrqHandler(1U, 1U);
}

void PIT1_Ch2_IRQHandler(void)
{
    TIMING_Pit_IrqHandler(1U, 2U);
}

void PIT1_Ch3_IRQHandler(void)
{
    TIMING_Pit_IrqHandler(1U, 3U);
}
#endif /* PIT_INSTANCE_COUNT > 1U */


#endif /* TIMING_OVER_PIT */

/* Define TIMING PAL over FTM */
#if (defined(TIMING_OVER_FTM))

#if (FTM_INSTANCE_COUNT > 0U)
#if (FEATURE_FTM_HAS_NUM_IRQS_CHANS == 1U)
void FTM0_Ch0_7_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[0];
    bool chan0IntFlag = FTM_DRV_GetChnEventStatus(base, 0U);
    bool chan1IntFlag = FTM_DRV_GetChnEventStatus(base, 1U);
    bool chan2IntFlag = FTM_DRV_GetChnEventStatus(base, 2U);
    bool chan3IntFlag = FTM_DRV_GetChnEventStatus(base, 3U);
    bool chan4IntFlag = FTM_DRV_GetChnEventStatus(base, 4U);
    bool chan5IntFlag = FTM_DRV_GetChnEventStatus(base, 5U);
    bool chan6IntFlag = FTM_DRV_GetChnEventStatus(base, 6U);
    bool chan7IntFlag = FTM_DRV_GetChnEventStatus(base, 7U);

    if (chan0IntFlag && g_ftmChannelRunning[0][0])
    {
        TIMING_Ftm_IrqHandler(0U, 0U);
    }

    if (chan1IntFlag && g_ftmChannelRunning[0][1])
    {
        TIMING_Ftm_IrqHandler(0U, 1U);
    }

    if (chan2IntFlag && g_ftmChannelRunning[0][2])
    {
        TIMING_Ftm_IrqHandler(0U, 2U);
    }

    if (chan3IntFlag && g_ftmChannelRunning[0][3])
    {
        TIMING_Ftm_IrqHandler(0U, 3U);
    }

    if (chan4IntFlag && g_ftmChannelRunning[0][4])
    {
        TIMING_Ftm_IrqHandler(0U, 4U);
    }

    if (chan5IntFlag && g_ftmChannelRunning[0][5])
    {
        TIMING_Ftm_IrqHandler(0U, 5U);
    }

    if (chan6IntFlag && g_ftmChannelRunning[0][6])
    {
        TIMING_Ftm_IrqHandler(0U, 6U);
    }

    if (chan7IntFlag && g_ftmChannelRunning[0][7])
    {
        TIMING_Ftm_IrqHandler(0U, 7U);
    }
}
#else
void FTM0_Ch0_Ch1_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[0];
    bool chan0IntFlag = FTM_DRV_GetChnEventStatus(base, 0U);
    bool chan1IntFlag = FTM_DRV_GetChnEventStatus(base, 1U);

    if (chan0IntFlag && g_ftmChannelRunning[0][0])
    {
        TIMING_Ftm_IrqHandler(0U, 0U);
    }

    if (chan1IntFlag && g_ftmChannelRunning[0][1])
    {
        TIMING_Ftm_IrqHandler(0U, 1U);
    }
}

void FTM0_Ch2_Ch3_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[0];
    bool chan2IntFlag = FTM_DRV_GetChnEventStatus(base, 2U);
    bool chan3IntFlag = FTM_DRV_GetChnEventStatus(base, 3U);

