sanjeev7-marvel/S32_MBD/MATLAB_Add-Ons/Toolboxes/NXP_MBDToolbox_S32K1xx/S32_Platform_SDK/platform/pal/src/timing/timing_irq.c
    if (chan0IntFlag && g_ftmChannelRunning[2][0])
    {
        TIMING_Ftm_IrqHandler(2U, 0U);
    }

    if (chan1IntFlag && g_ftmChannelRunning[2][1])
    {
        TIMING_Ftm_IrqHandler(2U, 1U);
    }
}

void FTM2_Ch2_Ch3_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[2];
    bool chan2IntFlag = FTM_DRV_GetChnEventStatus(base, 2U);
    bool chan3IntFlag = FTM_DRV_GetChnEventStatus(base, 3U);

    if (chan2IntFlag && g_ftmChannelRunning[2][2])
    {
        TIMING_Ftm_IrqHandler(2U, 2U);
    }

    if (chan3IntFlag && g_ftmChannelRunning[2][3])
    {
        TIMING_Ftm_IrqHandler(2U, 3U);
    }
}

void FTM2_Ch4_Ch5_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[2];
    bool chan4IntFlag = FTM_DRV_GetChnEventStatus(base, 4U);
    bool chan5IntFlag = FTM_DRV_GetChnEventStatus(base, 5U);

    if (chan4IntFlag && g_ftmChannelRunning[2][4])
    {
        TIMING_Ftm_IrqHandler(2U, 4U);
    }

    if (chan5IntFlag && g_ftmChannelRunning[2][5])
    {
        TIMING_Ftm_IrqHandler(2U, 5U);
    }
}

void FTM2_Ch6_Ch7_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[2];
    bool chan6IntFlag = FTM_DRV_GetChnEventStatus(base, 6U);
    bool chan7IntFlag = FTM_DRV_GetChnEventStatus(base, 7U);

    if (chan6IntFlag && g_ftmChannelRunning[2][6])
    {
        TIMING_Ftm_IrqHandler(2U, 6U);
    }

    if (chan7IntFlag && g_ftmChannelRunning[2][7])
    {
        TIMING_Ftm_IrqHandler(2U, 7U);
    }
}
#endif /* FEATURE_FTM_HAS_NUM_IRQS_CHANS == 1U */
#endif /* FTM_INSTANCE_COUNT > 2U */

#if (FTM_INSTANCE_COUNT > 3U)
#if (FEATURE_FTM_HAS_NUM_IRQS_CHANS == 1U)
void FTM3_Ch0_7_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[3];
    bool chan0IntFlag = FTM_DRV_GetChnEventStatus(base, 0U);
    bool chan1IntFlag = FTM_DRV_GetChnEventStatus(base, 1U);
    bool chan2IntFlag = FTM_DRV_GetChnEventStatus(base, 2U);
    bool chan3IntFlag = FTM_DRV_GetChnEventStatus(base, 3U);
    bool chan4IntFlag = FTM_DRV_GetChnEventStatus(base, 4U);
    bool chan5IntFlag = FTM_DRV_GetChnEventStatus(base, 5U);
    bool chan6IntFlag = FTM_DRV_GetChnEventStatus(base, 6U);
    bool chan7IntFlag = FTM_DRV_GetChnEventStatus(base, 7U);

    if (chan0IntFlag && g_ftmChannelRunning[3][0])
    {
        TIMING_Ftm_IrqHandler(3U, 0U);
    }

    if (chan1IntFlag && g_ftmChannelRunning[3][1])
    {
        TIMING_Ftm_IrqHandler(3U, 1U);
    }

    if (chan2IntFlag && g_ftmChannelRunning[3][2])
    {
        TIMING_Ftm_IrqHandler(3U, 2U);
    }

    if (chan3IntFlag && g_ftmChannelRunning[3][3])
    {
        TIMING_Ftm_IrqHandler(3U, 3U);
    }

    if (chan4IntFlag && g_ftmChannelRunning[3][4])
    {
        TIMING_Ftm_IrqHandler(3U, 4U);
    }

    if (chan5IntFlag && g_ftmChannelRunning[3][5])
    {
        TIMING_Ftm_IrqHandler(3U, 5U);
    }

    if (chan6IntFlag && g_ftmChannelRunning[3][6])
    {
        TIMING_Ftm_IrqHandler(3U, 6U);
    }

    if (chan7IntFlag && g_ftmChannelRunning[3][7])
    {
        TIMING_Ftm_IrqHandler(3U, 7U);
    }
}
#else
void FTM3_Ch0_Ch1_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[3];
    bool chan0IntFlag = FTM_DRV_GetChnEventStatus(base, 0U);
    bool chan1IntFlag = FTM_DRV_GetChnEventStatus(base, 1U);

    if (chan0IntFlag && g_ftmChannelRunning[3][0])
    {
        TIMING_Ftm_IrqHandler(3U, 0U);
    }

    if (chan1IntFlag && g_ftmChannelRunning[3][1])
    {
        TIMING_Ftm_IrqHandler(3U, 1U);
    }
}

void FTM3_Ch2_Ch3_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[3];
    bool chan2IntFlag = FTM_DRV_GetChnEventStatus(base, 2U);
    bool chan3IntFlag = FTM_DRV_GetChnEventStatus(base, 3U);

    if (chan2IntFlag && g_ftmChannelRunning[3][2])
    {
        TIMING_Ftm_IrqHandler(3U, 2U);
    }

    if (chan3IntFlag && g_ftmChannelRunning[3][3])
    {
        TIMING_Ftm_IrqHandler(3U, 3U);
    }
}

void FTM3_Ch4_Ch5_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[3];
    bool chan4IntFlag = FTM_DRV_GetChnEventStatus(base, 4U);
    bool chan5IntFlag = FTM_DRV_GetChnEventStatus(base, 5U);

    if (chan4IntFlag && g_ftmChannelRunning[3][4])
    {
        TIMING_Ftm_IrqHandler(3U, 4U);
    }

    if (chan5IntFlag && g_ftmChannelRunning[3][5])
    {
        TIMING_Ftm_IrqHandler(3U, 5U);
    }
}

void FTM3_Ch6_Ch7_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[3];
    bool chan6IntFlag = FTM_DRV_GetChnEventStatus(base, 6U);
    bool chan7IntFlag = FTM_DRV_GetChnEventStatus(base, 7U);

    if (chan6IntFlag && g_ftmChannelRunning[3][6])
    {
        TIMING_Ftm_IrqHandler(3U, 6U);
    }

    if (chan7IntFlag && g_ftmChannelRunning[3][7])
    {
        TIMING_Ftm_IrqHandler(3U, 7U);
    }
}
#endif /* FEATURE_FTM_HAS_NUM_IRQS_CHANS == 1U */
#endif /* FTM_INSTANCE_COUNT > 3U */

#if (FTM_INSTANCE_COUNT > 4U)
#if (FEATURE_FTM_HAS_NUM_IRQS_CHANS == 1U)
void FTM4_Ch0_7_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[4];
    bool chan0IntFlag = FTM_DRV_GetChnEventStatus(base, 0U);
    bool chan1IntFlag = FTM_DRV_GetChnEventStatus(base, 1U);
    bool chan2IntFlag = FTM_DRV_GetChnEventStatus(base, 2U);
    bool chan3IntFlag = FTM_DRV_GetChnEventStatus(base, 3U);
    bool chan4IntFlag = FTM_DRV_GetChnEventStatus(base, 4U);
    bool chan5IntFlag = FTM_DRV_GetChnEventStatus(base, 5U);
    bool chan6IntFlag = FTM_DRV_GetChnEventStatus(base, 6U);
    bool chan7IntFlag = FTM_DRV_GetChnEventStatus(base, 7U);

    if (chan0IntFlag && g_ftmChannelRunning[4][0])
    {
        TIMING_Ftm_IrqHandler(4U, 0U);
    }

    if (chan1IntFlag && g_ftmChannelRunning[4][1])
    {
        TIMING_Ftm_IrqHandler(4U, 1U);
    }

    if (chan2IntFlag && g_ftmChannelRunning[4][2])
    {
        TIMING_Ftm_IrqHandler(4U, 2U);
    }

    if (chan3IntFlag && g_ftmChannelRunning[4][3])
    {
        TIMING_Ftm_IrqHandler(4U, 3U);
    }

    if (chan4IntFlag && g_ftmChannelRunning[4][4])
    {
        TIMING_Ftm_IrqHandler(4U, 4U);
    }

    if (chan5IntFlag && g_ftmChannelRunning[4][5])
    {
        TIMING_Ftm_IrqHandler(4U, 5U);
    }

    if (chan6IntFlag && g_ftmChannelRunning[4][6])
    {
        TIMING_Ftm_IrqHandler(4U, 6U);
    }

