sanjeev7-marvel/S32_MBD/MATLAB_Add-Ons/Toolboxes/NXP_MBDToolbox_S32K1xx/S32_Platform_SDK/platform/pal/src/timing/timing_irq.c
    if (chan7IntFlag && g_ftmChannelRunning[4][7])
    {
        TIMING_Ftm_IrqHandler(4U, 7U);
    }
}
#else
void FTM4_Ch0_Ch1_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[4];
    bool chan0IntFlag = FTM_DRV_GetChnEventStatus(base, 0U);
    bool chan1IntFlag = FTM_DRV_GetChnEventStatus(base, 1U);

    if (chan0IntFlag && g_ftmChannelRunning[4][0])
    {
        TIMING_Ftm_IrqHandler(4U, 0U);
    }

    if (chan1IntFlag && g_ftmChannelRunning[4][1])
    {
        TIMING_Ftm_IrqHandler(4U, 1U);
    }
}

void FTM4_Ch2_Ch3_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[4];
    bool chan2IntFlag = FTM_DRV_GetChnEventStatus(base, 2U);
    bool chan3IntFlag = FTM_DRV_GetChnEventStatus(base, 3U);

    if (chan2IntFlag && g_ftmChannelRunning[4][2])
    {
        TIMING_Ftm_IrqHandler(4U, 2U);
    }

    if (chan3IntFlag && g_ftmChannelRunning[4][3])
    {
        TIMING_Ftm_IrqHandler(4U, 3U);
    }
}

void FTM4_Ch4_Ch5_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[4];
    bool chan4IntFlag = FTM_DRV_GetChnEventStatus(base, 4U);
    bool chan5IntFlag = FTM_DRV_GetChnEventStatus(base, 5U);

    if (chan4IntFlag && g_ftmChannelRunning[4][4])
    {
        TIMING_Ftm_IrqHandler(4U, 4U);
    }

    if (chan5IntFlag && g_ftmChannelRunning[4][5])
    {
        TIMING_Ftm_IrqHandler(4U, 5U);
    }
}

void FTM4_Ch6_Ch7_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[4];
    bool chan6IntFlag = FTM_DRV_GetChnEventStatus(base, 6U);
    bool chan7IntFlag = FTM_DRV_GetChnEventStatus(base, 7U);

    if (chan6IntFlag && g_ftmChannelRunning[4][6])
    {
        TIMING_Ftm_IrqHandler(4U, 6U);
    }

    if (chan7IntFlag && g_ftmChannelRunning[4][7])
    {
        TIMING_Ftm_IrqHandler(4U, 7U);
    }
}
#endif /* FEATURE_FTM_HAS_NUM_IRQS_CHANS == 1U */
#endif /* FTM_INSTANCE_COUNT > 4U */

#if (FTM_INSTANCE_COUNT > 5U)
#if (FEATURE_FTM_HAS_NUM_IRQS_CHANS == 1U)
void FTM5_Ch0_7_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[5];
    bool chan0IntFlag = FTM_DRV_GetChnEventStatus(base, 0U);
    bool chan1IntFlag = FTM_DRV_GetChnEventStatus(base, 1U);
    bool chan2IntFlag = FTM_DRV_GetChnEventStatus(base, 2U);
    bool chan3IntFlag = FTM_DRV_GetChnEventStatus(base, 3U);
    bool chan4IntFlag = FTM_DRV_GetChnEventStatus(base, 4U);
    bool chan5IntFlag = FTM_DRV_GetChnEventStatus(base, 5U);
    bool chan6IntFlag = FTM_DRV_GetChnEventStatus(base, 6U);
    bool chan7IntFlag = FTM_DRV_GetChnEventStatus(base, 7U);

    if (chan0IntFlag && g_ftmChannelRunning[5][0])
    {
        TIMING_Ftm_IrqHandler(5U, 0U);
    }

    if (chan1IntFlag && g_ftmChannelRunning[5][1])
    {
        TIMING_Ftm_IrqHandler(5U, 1U);
    }

    if (chan2IntFlag && g_ftmChannelRunning[5][2])
    {
        TIMING_Ftm_IrqHandler(5U, 2U);
    }

    if (chan3IntFlag && g_ftmChannelRunning[5][3])
    {
        TIMING_Ftm_IrqHandler(5U, 3U);
    }

    if (chan4IntFlag && g_ftmChannelRunning[5][4])
    {
        TIMING_Ftm_IrqHandler(5U, 4U);
    }

    if (chan5IntFlag && g_ftmChannelRunning[5][5])
    {
        TIMING_Ftm_IrqHandler(5U, 5U);
    }

    if (chan6IntFlag && g_ftmChannelRunning[5][6])
    {
        TIMING_Ftm_IrqHandler(5U, 6U);
    }

    if (chan7IntFlag && g_ftmChannelRunning[5][7])
    {
        TIMING_Ftm_IrqHandler(5U, 7U);
    }
}
#else
void FTM5_Ch0_Ch1_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[5];
    bool chan0IntFlag = FTM_DRV_GetChnEventStatus(base, 0U);
    bool chan1IntFlag = FTM_DRV_GetChnEventStatus(base, 1U);

    if (chan0IntFlag && g_ftmChannelRunning[5][0])
    {
        TIMING_Ftm_IrqHandler(5U, 0U);
    }

    if (chan1IntFlag && g_ftmChannelRunning[5][1])
    {
        TIMING_Ftm_IrqHandler(5U, 1U);
    }
}

void FTM5_Ch2_Ch3_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[5];
    bool chan2IntFlag = FTM_DRV_GetChnEventStatus(base, 2U);
    bool chan3IntFlag = FTM_DRV_GetChnEventStatus(base, 3U);

    if (chan2IntFlag && g_ftmChannelRunning[5][2])
    {
        TIMING_Ftm_IrqHandler(5U, 2U);
    }

    if (chan3IntFlag && g_ftmChannelRunning[5][3])
    {
        TIMING_Ftm_IrqHandler(5U, 3U);
    }
}

void FTM5_Ch4_Ch5_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[5];
    bool chan4IntFlag = FTM_DRV_GetChnEventStatus(base, 4U);
    bool chan5IntFlag = FTM_DRV_GetChnEventStatus(base, 5U);

    if (chan4IntFlag && g_ftmChannelRunning[5][4])
    {
        TIMING_Ftm_IrqHandler(5U, 4U);
    }

    if (chan5IntFlag && g_ftmChannelRunning[5][5])
    {
        TIMING_Ftm_IrqHandler(5U, 5U);
    }
}

void FTM5_Ch6_Ch7_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[5];
    bool chan6IntFlag = FTM_DRV_GetChnEventStatus(base, 6U);
    bool chan7IntFlag = FTM_DRV_GetChnEventStatus(base, 7U);

    if (chan6IntFlag && g_ftmChannelRunning[5][6])
    {
        TIMING_Ftm_IrqHandler(5U, 6U);
    }

    if (chan7IntFlag && g_ftmChannelRunning[5][7])
    {
        TIMING_Ftm_IrqHandler(5U, 7U);
    }
}
#endif /* FEATURE_FTM_HAS_NUM_IRQS_CHANS == 1U */
#endif /* FTM_INSTANCE_COUNT > 5U */

#if (FTM_INSTANCE_COUNT > 6U)
#if (FEATURE_FTM_HAS_NUM_IRQS_CHANS == 1U)
void FTM6_Ch0_7_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[6];
    bool chan0IntFlag = FTM_DRV_GetChnEventStatus(base, 0U);
    bool chan1IntFlag = FTM_DRV_GetChnEventStatus(base, 1U);
    bool chan2IntFlag = FTM_DRV_GetChnEventStatus(base, 2U);
    bool chan3IntFlag = FTM_DRV_GetChnEventStatus(base, 3U);
    bool chan4IntFlag = FTM_DRV_GetChnEventStatus(base, 4U);
    bool chan5IntFlag = FTM_DRV_GetChnEventStatus(base, 5U);
    bool chan6IntFlag = FTM_DRV_GetChnEventStatus(base, 6U);
    bool chan7IntFlag = FTM_DRV_GetChnEventStatus(base, 7U);

    if (chan0IntFlag && g_ftmChannelRunning[6][0])
    {
        TIMING_Ftm_IrqHandler(6U, 0U);
    }

    if (chan1IntFlag && g_ftmChannelRunning[6][1])
    {
        TIMING_Ftm_IrqHandler(6U, 1U);
    }

    if (chan2IntFlag && g_ftmChannelRunning[6][2])
    {
        TIMING_Ftm_IrqHandler(6U, 2U);
    }

