sanjeev7-marvel/S32_MBD/MATLAB_Add-Ons/Toolboxes/NXP_MBDToolbox_S32K1xx/S32_Platform_SDK/platform/pal/src/timing/timing_irq.c
    if (chan3IntFlag && g_ftmChannelRunning[6][3])
    {
        TIMING_Ftm_IrqHandler(6U, 3U);
    }

    if (chan4IntFlag && g_ftmChannelRunning[6][4])
    {
        TIMING_Ftm_IrqHandler(6U, 4U);
    }

    if (chan5IntFlag && g_ftmChannelRunning[6][5])
    {
        TIMING_Ftm_IrqHandler(6U, 5U);
    }

    if (chan6IntFlag && g_ftmChannelRunning[6][6])
    {
        TIMING_Ftm_IrqHandler(6U, 6U);
    }

    if (chan7IntFlag && g_ftmChannelRunning[6][7])
    {
        TIMING_Ftm_IrqHandler(6U, 7U);
    }
}
#else
void FTM6_Ch0_Ch1_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[6];
    bool chan0IntFlag = FTM_DRV_GetChnEventStatus(base, 0U);
    bool chan1IntFlag = FTM_DRV_GetChnEventStatus(base, 1U);

    if (chan0IntFlag && g_ftmChannelRunning[6][0])
    {
        TIMING_Ftm_IrqHandler(6U, 0U);
    }

    if (chan1IntFlag && g_ftmChannelRunning[6][1])
    {
        TIMING_Ftm_IrqHandler(6U, 1U);
    }
}

void FTM6_Ch2_Ch3_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[6];
    bool chan2IntFlag = FTM_DRV_GetChnEventStatus(base, 2U);
    bool chan3IntFlag = FTM_DRV_GetChnEventStatus(base, 3U);

    if (chan2IntFlag && g_ftmChannelRunning[6][2])
    {
        TIMING_Ftm_IrqHandler(6U, 2U);
    }

    if (chan3IntFlag && g_ftmChannelRunning[6][3])
    {
        TIMING_Ftm_IrqHandler(6U, 3U);
    }
}

void FTM6_Ch4_Ch5_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[6];
    bool chan4IntFlag = FTM_DRV_GetChnEventStatus(base, 4U);
    bool chan5IntFlag = FTM_DRV_GetChnEventStatus(base, 5U);

    if (chan4IntFlag && g_ftmChannelRunning[6][4])
    {
        TIMING_Ftm_IrqHandler(6U, 4U);
    }

    if (chan5IntFlag && g_ftmChannelRunning[6][5])
    {
        TIMING_Ftm_IrqHandler(6U, 5U);
    }
}

void FTM6_Ch6_Ch7_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[6];
    bool chan6IntFlag = FTM_DRV_GetChnEventStatus(base, 6U);
    bool chan7IntFlag = FTM_DRV_GetChnEventStatus(base, 7U);

    if (chan6IntFlag && g_ftmChannelRunning[6][6])
    {
        TIMING_Ftm_IrqHandler(6U, 6U);
    }

    if (chan7IntFlag && g_ftmChannelRunning[6][7])
    {
        TIMING_Ftm_IrqHandler(6U, 7U);
    }
}
#endif /* FEATURE_FTM_HAS_NUM_IRQS_CHANS == 1U */
#endif /* FTM_INSTANCE_COUNT > 6U */

#if (FTM_INSTANCE_COUNT > 7U)
#if (FEATURE_FTM_HAS_NUM_IRQS_CHANS == 1U)
void FTM7_Ch0_7_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[7];
    bool chan0IntFlag = FTM_DRV_GetChnEventStatus(base, 0U);
    bool chan1IntFlag = FTM_DRV_GetChnEventStatus(base, 1U);
    bool chan2IntFlag = FTM_DRV_GetChnEventStatus(base, 2U);
    bool chan3IntFlag = FTM_DRV_GetChnEventStatus(base, 3U);
    bool chan4IntFlag = FTM_DRV_GetChnEventStatus(base, 4U);
    bool chan5IntFlag = FTM_DRV_GetChnEventStatus(base, 5U);
    bool chan6IntFlag = FTM_DRV_GetChnEventStatus(base, 6U);
    bool chan7IntFlag = FTM_DRV_GetChnEventStatus(base, 7U);

    if (chan0IntFlag && g_ftmChannelRunning[7][0])
    {
        TIMING_Ftm_IrqHandler(7U, 0U);
    }

    if (chan1IntFlag && g_ftmChannelRunning[7][1])
    {
        TIMING_Ftm_IrqHandler(7U, 1U);
    }

    if (chan2IntFlag && g_ftmChannelRunning[7][2])
    {
        TIMING_Ftm_IrqHandler(7U, 2U);
    }

    if (chan3IntFlag && g_ftmChannelRunning[7][3])
    {
        TIMING_Ftm_IrqHandler(7U, 3U);
    }

    if (chan4IntFlag && g_ftmChannelRunning[7][4])
    {
        TIMING_Ftm_IrqHandler(7U, 4U);
    }

    if (chan5IntFlag && g_ftmChannelRunning[7][5])
    {
        TIMING_Ftm_IrqHandler(7U, 5U);
    }

    if (chan6IntFlag && g_ftmChannelRunning[7][6])
    {
        TIMING_Ftm_IrqHandler(7U, 6U);
    }

    if (chan7IntFlag && g_ftmChannelRunning[7][7])
    {
        TIMING_Ftm_IrqHandler(7U, 7U);
    }
}
#else
void FTM7_Ch0_Ch1_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[7];
    bool chan0IntFlag = FTM_DRV_GetChnEventStatus(base, 0U);
    bool chan1IntFlag = FTM_DRV_GetChnEventStatus(base, 1U);

    if (chan0IntFlag && g_ftmChannelRunning[7][0])
    {
        TIMING_Ftm_IrqHandler(7U, 0U);
    }

    if (chan1IntFlag && g_ftmChannelRunning[7][1])
    {
        TIMING_Ftm_IrqHandler(7U, 1U);
    }
}

void FTM7_Ch2_Ch3_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[7];
    bool chan2IntFlag = FTM_DRV_GetChnEventStatus(base, 2U);
    bool chan3IntFlag = FTM_DRV_GetChnEventStatus(base, 3U);

    if (chan2IntFlag && g_ftmChannelRunning[7][2])
    {
        TIMING_Ftm_IrqHandler(7U, 2U);
    }

    if (chan3IntFlag && g_ftmChannelRunning[7][3])
    {
        TIMING_Ftm_IrqHandler(7U, 3U);
    }
}

void FTM7_Ch4_Ch5_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[7];
    bool chan4IntFlag = FTM_DRV_GetChnEventStatus(base, 4U);
    bool chan5IntFlag = FTM_DRV_GetChnEventStatus(base, 5U);

    if (chan4IntFlag && g_ftmChannelRunning[7][4])
    {
        TIMING_Ftm_IrqHandler(7U, 4U);
    }

    if (chan5IntFlag && g_ftmChannelRunning[7][5])
    {
        TIMING_Ftm_IrqHandler(7U, 5U);
    }
}

void FTM7_Ch6_Ch7_IrqHandler(void)
{
    const FTM_Type * const base = ftmBase[7];
    bool chan6IntFlag = FTM_DRV_GetChnEventStatus(base, 4U);
    bool chan7IntFlag = FTM_DRV_GetChnEventStatus(base, 5U);

    if (chan6IntFlag && g_ftmChannelRunning[7][6])
    {
        TIMING_Ftm_IrqHandler(7U, 6U);
    }

    if (chan7IntFlag && g_ftmChannelRunning[7][7])
    {
        TIMING_Ftm_IrqHandler(7U, 7U);
    }
}
#endif /* FEATURE_FTM_HAS_NUM_IRQS_CHANS == 1U */
#endif /* FTM_INSTANCE_COUNT > 7U */

/* Array storing references to TIMING over FTM irq handlers */
const isr_t s_timingOverFtmIsr[FTM_INSTANCE_COUNT][FTM_CONTROLS_COUNT] =
{
#if (FTM_INSTANCE_COUNT > 0U)
#if (FEATURE_FTM_HAS_NUM_IRQS_CHANS == 1U)
    {FTM0_Ch0_7_IrqHandler,
     FTM0_Ch0_7_IrqHandler,
     FTM0_Ch0_7_IrqHandler,
     FTM0_Ch0_7_IrqHandler,
     FTM0_Ch0_7_IrqHandler,
     FTM0_Ch0_7_IrqHandler,
     FTM0_Ch0_7_IrqHandler,
     FTM0_Ch0_7_IrqHandler},
#else
    {FTM0_Ch0_Ch1_IrqHandler,
     FTM0_Ch0_Ch1_IrqHandler,
     FTM0_Ch2_Ch3_IrqHandler,
     FTM0_Ch2_Ch3_IrqHandler,
     FTM0_Ch4_Ch5_IrqHandler,
     FTM0_Ch4_Ch5_IrqHandler,
     FTM0_Ch6_Ch7_IrqHandler,
     FTM0_Ch6_Ch7_IrqHandler},
#endif /* FEATURE_FTM_HAS_NUM_IRQS_CHANS == 1U */
#endif /* FTM_INSTANCE_COUNT > 0U */

